database = {
    1: {
        "Пельмешкин Максим": 22,
        "Пельмешкина Наталья": 21,
        "Пельмешкин Евгений": 12
    },
    2: {
        "Семушкин Евгений": 35,
        "Семушкина Наталья": 32,
        "Семушкин Павел": 18
    },
    3: {
        "Плашкин Григорий": 45,
        "Плашкина Ольга": 39,
        "Плашкин Валерий": 16
    },
    4: {
        "Гусев Леонид": 67,
        "Гусева Леонора": 58,
        "Гусев Федор": 39,
    }
}

surname = input("Введите фамилию: ")
if list(surname)[-1] == 'a':
    surname = surname[::-1]

for key in database.keys():
    for value in database[key].keys():
        if surname[:-1] in value:
            print(value, "", database[key][value])
